
 /* Copyright 2026 Ross Shkurat
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

 main: procedure options(main);
 %include net;

   declare
     request  char(256) varying,
     response char(2048),
     host     char(256) varying init('example.com:80'),
     bytes    size_t,
     conn     like conncb;

   on condition(neterror) begin;
     display('Networking error, code = ' || oncode());
     goto done;
   end;

   request =
       'GET / HTTP/1.1'    || LINE_END ||
       'Host: ' || host    || LINE_END ||
       'Connection: close' || LINE_END || LINE_END;
   
   call netdial(conn, host, AF.INET);

   call netwriteall(conn, request); 
   bytes = netreadall(conn, response);

   display('Response ' || substr(response, 1, bytes));
 
 done:
   call netclose(conn);  
 end;
