 /* Copyright 2026 Ross Shkurat - Apache-2.0, see LICENSE 
    
    A basic example of using libnet to make a simple HTTP GET 
    request to a server and read the response, with error handling.

    Run with:
      ./build.sh run readme_usage.pli
 */

 main: procedure options(main);
 %include net;

   declare
     request  char(256) varying,
     host     char(256) varying init('example.com:80'),
     bytes    size_t,
     conn     like conncb,
     response_ptr pointer init(null),
     response char(MAX_VARYING) varying based(response_ptr);
  
   on condition(neterror) begin;  /* handle low-level network errors */
     display('Networking error, code = ' || oncode());
     goto done;
   end;

   request =
       'GET / HTTP/1.1'    || CR_LF ||
       'Host: ' || host    || CR_LF ||
       'Connection: close' || CR_LF || CR_LF;
   
   call net_dial(conn, host, AF.INET);  /* host is auto-resolved */
   conn.read_timeout = 5000; /* avoid hang */
   conn.write_timeout = 5000;

   call net_write_all(conn, request); 
   bytes = net_read_all(conn, response_ptr);

   /* only reached unless there's a network error */
   display('Response ' || response);
 
 done:
   if response_ptr ¬= null then free response;
   call net_close(conn); 
 end;
