
 /* Copyright 2026 Ross Shkurat
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *    http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or
 * implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 */

 main: proc options(main);

 %include net;

   dcl host       char(256);
   dcl port       fixed bin(31);
   dcl sock       like net_t;
   dcl request    char(256) varying;
   dcl response   char(4096);
   dcl bytes      size_t;

   on condition(net_error) begin;
     put skip list('Socket error, code =', oncode());
     goto done;
   end;

   host = '127.0.0.1';
   port = 8080;
   request = 'Hello from error test!' || LINE_END;

   put skip list('Attempting connection to', trim(host), ':', port);

   call net_new(sock, AF.INET, TYPE.STREAM, 0); 
   call net_connect(sock, host, port);
   put skip list('Connected');

   bytes = net_send(sock, request, 0);
   put skip list('Sent', bytes, 'bytes');

   bytes = net_receive(sock, response, 0);
   if bytes > 0 then
     put skip list('Received:', substr(response, 1, bytes));
   else
     put skip list('No response received');

   call net_close(sock);
   put skip list('Done');

 done:
   put skip list('Test complete');
 end main;
