 /* Copyright 2026 Ross Shkurat - Apache-2.0, see LICENSE */

 main: proc options(main);
 %include net;

   dcl host       char(256);
   dcl port       fixed bin(31);
   dcl request    char(2048) varying;
   dcl (bytes_sent, bytes_received) size_t;
   dcl response   char(2048);
   dcl conn like conncb;

   host = '127.0.0.1';  /* or host = 'localhost'; */
   port = 8080;
   request =
       'GET / HTTP/1.1' || LINE_END ||
       'Host: ' || trim(host) || ":" || trim(port) || LINE_END ||
       'Connection: close' || LINE_END || LINE_END;
   display("REQUEST: " || LINE_END || trim(char(request)));
   
   call netnew(conn, AF.INET, TYPE.STREAM, 0);
   call netconnect(conn, host, port);
   display("       CONNECTED...");

   bytes_sent = netwrite(conn, request);
   display(' >> bytes sent ' || trim(char(bytes_sent)));

   bytes_received = netread(conn, response);
   display(' >> bytes received ' || bytes_received);
   display(' >> response ' || substr(response, 1, bytes_received));

   call netclose(conn); 
 end main;
