 /* Copyright 2026 Ross Shkurat - Apache-2.0, see LICENSE */

 net: package exports(net_listen, net_accept);

 %include c_bridge;
 %include net_errors;
 %include net_helpers;

 net_listen: proc(conn, port, backlog);
   dcl conn    like conncb;
   dcl port    port_t;
   dcl backlog backlog_t;

   dcl ip_buf char(64) init((64)'00'x);
   dcl port_out fixed bin(31);

   /* bind socket */
   if c_bind(conn.fd, port, conn.addr_family, INADDR.ANY) < 0 then do;
     signal condition(neterror) set oncode(c_get_errno());
     return;
   end;

   /* listen */
   if c_listen(conn.fd, backlog) < 0 then do;
     signal condition(neterror) set oncode(c_get_errno());
     return;
   end;

   /* update conncb */
   conn.port = port;
   conn.is_connected = '1'b;
   
   /* handle ephemeral port 0 */
   if port = 0 then do;
     ip_buf = (64)'00'x;
     if c_getsockname(conn.fd, addr(ip_buf), 64, addr(port_out)) = 0 then
       conn.port = port_out;
   end;
 end net_listen;

 net_accept: proc(server, client) returns(fixed bin(31));
   dcl server like conncb;
   dcl client like conncb;
   dcl client_fd sock_fd_t;

   /* apply accept timeout */
   call apply_timeout(server, 1);

   /* accept client */
   client_fd = c_accept(server.fd);
   if client_fd < 0 then do;
     signal condition(neterror) set oncode(c_get_errno());
     return;
   end;

   /* init client conncb */
   client.fd = client_fd;
   client.is_connected = '1'b;
   client.read_timeout = 0;
   client.write_timeout = 0;

   /* fill peer addr */
   begin;
     dcl ip_buf char(64) init((64)'00'x);
     dcl port_out fixed bin(31);
     dcl null_pos fixed bin(31);
     if c_getpeername(client.fd, addr(ip_buf), 64, addr(port_out)) = 0 then do;
       null_pos = index(ip_buf, '00'x);
       if null_pos = 0 then null_pos = length(ip_buf) + 1;
       client.ip_addr = substr(ip_buf, 1, null_pos - 1);
       
       client.port = port_out;
       client.host_name = client.ip_addr;
       client.addr_family = server.addr_family;
       client.sock_type = server.sock_type;
     end;
   end;
 end net_accept;

 end net;